package QuizAnswer;

public class basic0117 {
//	문제1
//
//	루피와 뽀로로는 각각 버스와 지하철을 타고 학교에 갑니다.
//	루피는 5000원을 가지고 있었고, 100번 버스를 타면서 1000원을 지불합니다.
//	뽀로로는 10000원을 가지고 있었고, 초록색 지하철을 타면서 1200원을 지불합니다.
//
//	두 친구가 버스와 지하철을 타는 상황을 구현해 보세요
//
//	문제2
//	노래 한 곡을 나타내는 PowerNoise클래스를 작성하라. 
//	PowerNoise은 다음 필드로 구성된다.
//	노래의 제목을 나타내는 title
//	가수를 나타내는 artist
//	노래가 발표된 연도를 나타내는 year
//	국적을 나타내는 country
//	또한 PowerNoise 클래스에 다음 생성자와 메소드를 작성하라.
//
//	생성자 2개: 기본 생성자와 매개변수로 모든 필드를 초기화하는 생성자
//	노래 정보를 출력하는 show( ) 메소드
//	main( ) 메소드에서는 2015년, 
//	대한민국 국적의 군침이가 부른 "hwaryo han gunchim"을 Song 객체로 생성하고 
//	show()를 이용하여 노래의 정보를 다음과 같이 출력하라.
//
//	2015년 대한민국 국적의 군침이가 부른 hwaryo han gunchim
}
