package OOP0111;

public class interFace {
	// 인터페이스 
	// -추상화를 더욱 구조적으로 돕는 도구 
	// -객체 사용 설명서 
	// -설계도는 설계도지만 실제로 구현한건 아무 것도 없는 설계도 
	// - 
	
	// 인터페이스 특징
	// 생성자를 선언 및 정의 할 수 없음. 
	// 인터페이스의 멤버 변수는 무조건 public static final이 선언되어야 한다. 
	// 인터페이스에 선언되는 메서드는 public abstract 선언되어야 함. 
	
	// 인터페이스의 장점
	// 1. 개발 시간 단축
	 //  => 선언과 구현을 각각 나눠서 
	///     구현 Method를 작성하는 개발자들이 작업하기 용이 
	//      (독립적 프로그래밍이 가능해짐)
	
	// 2. 표준화가 가능
	//    => 메서드명 통일 
	// 3. 서로 관계 없는 클래스를 간접적인 관계를 형성 가능. 
	
	
	
	
	// 현업에서 많이 쓰는 것과 쓰지 않는 것의 차이 
	// 1. 가독성, 유지보수성, 확장성, 재사용성 중 
	//	  2개 이상 만족하지 못하면 안쓸 가능성이 높음 
	// 2. 금전적으로 이득이 어느정도인가,. 
}
