package Stream;

import java.text.Format;

public class StreamExam {
	public static void main(String[] args) {
		// 스트림: 실제 입력, 출력이 표현된 데이터의 이상화 된 흐름
		//    -> OS에 의해 생성되어 가상의 연결고리 
		
		// 일반 스트림(입출력스트림)
		// - 입력과 출력을 동시에 처리는 불가. [단방향]
		// - 사용목적에 따라 입출력으로 잘게 구분
		// 기본적으로 입력은 InputStream
		// 		   출력은 OutputStream
		// 스트림 생성 = 스트림 클래스 타입의 인스턴스 생성;
		// 스트림은 예외처리가 항상 붙어있어야 함. --> 시스템을 제어함.
		
		
		
		// 스트림 API(자바 1.8 version)
		// 데이터 처리를 쉽게 하기 위해 도입된 개념
		// 데이터를 추상화 하여 다루고 다양한 방식으로 저장된
		// 데이터를 읽고 쓰기위한 공통의 방법을 제공
		// 배열, 컬렉션 뿐만 아닌 파일에 저장된 데이터도 
		// 다 같은 방법으로 다룬다.. 
		
		
	
	}
}
